Repository: bogdanbabych/0945BUT10201-lex2
Catalog: data/s01rawFiles/gnu-en--de-v03.tmx
Source language: en
Languages: de

source: An initial kernel exists but many more features are needed to emulate Unix.
de: Ein anfänglicher Systemkern existiert, es werden aber noch viele Funktionen benötigt, um Unix emulieren zu können.

source: When the kernel and compiler are finished, it will be possible to distribute a GNU system suitable for program development.
de: Sobald Systemkern und Compiler fertiggestellt sind, wird es möglich sein, ein zur Programmentwicklung einsatzfähiges GNU-System zu verteilen.

source: We will use TeX as our text formatter, but an nroff is being worked on.
de: Wir werden TeX als Textsatzsystem einsetzen, aber auch an Nroff wird gearbeitet.

source: We will use the free, portable X Window System as well.
de: Auch werden wir das freie, portable X Window System verwenden.

source: After this we will add a portable Common Lisp, an Empire game, a spreadsheet, and hundreds of other things, plus online documentation.
de: Danach werden wir ein portables Common Lisp hinzufügen, ein Empire-Spiel, eine Tabellenkalkulation und hunderte weiterer Dinge plus Online-Dokumentation.

source: We hope to supply, eventually, everything useful that normally comes with a Unix system, and more.
de: Wir hoffen, schließlich alles Nützliche bereitstellen zu können, was normalerweise zu einem Unix-System gehört und vieles mehr.

source: GNU will be able to run Unix programs, but will not be identical to Unix.
de: GNU wird in der Lage sein Unix-Programme auszuführen, aber nicht mit Unix identisch sein.

source: We will make all improvements that are convenient, based on our experience with other operating systems.
de: Auf Grundlage unserer Erfahrungen mit anderen Betriebssystemen werden wir alle gebräuchlichen Verbesserungen vornehmen.

source: In particular, we plan to have longer file names, file version numbers, a crashproof file system, file name completion perhaps, terminal-independent display support, and perhaps eventually a Lisp-based window system through which several Lisp programs and ordinary Unix programs can share a screen.
de: Insbesondere planen wir längere Dateinamen, Datei-Versionsnummern, ein absturzsicheres Dateisystem, eventuell Dateitypendungen, terminalunabhängige Anzeigeunterstützung und vielleicht irgendwann ein Lisp-basiertes Fenstersystem, durch welches mehrere Lisp- und gewöhnliche Unix-Programme sich einen Bildschirm teilen können.

source: Both C and Lisp will be available as system programming languages.
de: Sowohl C und Lisp werden als Systemprogrammiersprachen verfügbar sein.

source: We will try to support UUCP, MIT Chaosnet, and Internet protocols for communication.
de: Für die Kommunikation beabsichtigen wir UUCP, MIT Chaosnet sowie Internetprotokolle zu unterstützen.

source: GNU is aimed initially at machines in the 68000/16000 class with virtual memory, because they are the easiest machines to make it run on.
de: GNU richtet sich zunächst an Rechner der 68000/16000-Klasse mit virtuellem Speicher, weil es auf diesen am leichtesten lauffähig gemacht werden kann.

source: The extra effort to make it run on smaller machines will be left to someone who wants to use it on them.
de: Den zusätzlichen Aufwand, es auf kleinere Rechner zu portieren, überlassen wir jemandem, der es auf diesen verwenden will.

source: To avoid horrible confusion, please pronounce the g in the word “GNU” when it is the name of this project.
de: Um fürchterliche Verwechselungen zu vermeiden, sprechen Sie bitte das g im Wort GNU mit aus, wenn es sich dabei um den Namen dieses Projekts handelt.

source: Why I Must Write GNU I consider that the Golden Rule requires that if I like a program I must share it with other people who like it.
de: Warum ich GNU schreiben muss Ich denke, die Goldene Regel verlangt, dass, wenn ich ein Programm mag, ich es mit Anderen gemeinsam nutzen muss, die es mögen.

source: Software sellers want to divide the users and conquer them, making each user agree not to share with others.
de: Softwareanbieter hingegen wollen die Benutzer entzweien und unterwerfen, wobei sie jeden Anwender dazu verpflichten, nicht mit anderen zu teilen.

source: I refuse to break solidarity with other users in this way.
de: Ich weigere mich, die Solidarität mit anderen Nutzern auf diese Weise zu brechen.

source: I cannot in good conscience sign a nondisclosure agreement or a software license agreement.
de: Ich kann nicht guten Gewissens eine Vertraulichkeits- oder Softwarelizenzvereinbarung unterzeichnen.

source: For years I worked within the Artificial Intelligence Lab to resist such tendencies and other inhospitalities, but eventually they had gone too far: I could not remain in an institution where such things are done for me against my will.
de: Jahrelang arbeitete ich im Labor für künstliche Intelligenz (KI-Labor) des MIT, um solchen Tendenzen und nicht vorhandenen Gastfreundlichkeiten zu widerstehen, aber letzten Endes waren sie zu weit gegangen: Ich konnte nicht in einer Institution bleiben, in der solche Dinge gegen meinen Willen geschehen.

source: So that I can continue to use computers without dishonor, I have decided to put together a sufficient body of free software so that I will be able to get along without any software that is not free.
de: Damit ich weiterhin Rechner ohne Schmach benutzen kann, habe ich beschlossen, eine genügend große Sammlung von freier Software zusammenzustellen, so dass ich in der Lage sein werde, ohne jegliche unfreie Software auszukommen.

source: I have resigned from the AI Lab to deny MIT any legal excuse to prevent me from giving GNU away.(2)
de: Ich habe beim KI-Labor gekündigt, um dem MIT keinen rechtlichen Vorwand zu bieten, mich daran zu hindern, GNU zu verschenken.(2)

source: Why GNU Will Be Compatible with Unix Unix is not my ideal system, but it is not too bad.
de: Warum wird GNU mit Unix kompatibel sein Unix ist nicht mein ideales System, aber es ist nicht so übel.

source: The essential features of Unix seem to be good ones, and I think I can fill in what Unix lacks without spoiling them.
de: Die wesentlichen Eigenschaften von Unix scheinen gute zu sein, und ich denke, dass ich fehlendes ergänzen kann, ohne die guten Eigenschaften zu verderben.

source: And a system compatible with Unix would be convenient for many other people to adopt.
de: Und ein mit Unix kompatibles System wäre für viele Menschen angenehm zu übernehmen.

source: How GNU Will Be Available GNU is not in the public domain.
de: Wie GNU erhältlich sein wird GNU ist nicht in der Public Domain.

source: Everyone will be permitted to modify and redistribute GNU, but no distributor will be allowed to restrict its further redistribution.
de: Jedermanm wird erlaubt sein, GNU zu modifizieren und weiterzugeben, aber keinem Distributor wird erlaubt sein, die Weitergabe zu beschränken.

source: That is to say, proprietary modifications will not be allowed.
de: D. h. proprietäre Modifikationen werden nicht erlaubt sein.

source: I want to make sure that all versions of GNU remain free.
de: Ich möchte damit sicherstellen, dass alle Varianten von GNU frei bleiben.

source: Why Many Other Programmers Want to Help I have found many other programmers who are excited about GNU and want to help.
de: Warum viele andere Programmierer mithelfen wollen Ich habe viele andere Programmierer gefunden, die von GNU begeistert sind und helfen wollen.

source: Many programmers are unhappy about the commercialization of system software.
de: Viele Programmierer sind mit der Kommerzialisierung von Systemsoftware unzufrieden.

source: It may enable them to make more money, but it requires them to feel in conflict with other programmers in general rather than feel as comrades.
de: Es mag ihnen die Möglichkeit geben, mehr Geld zu verdienen, aber es zwingt sie gleichzeitig, andere Programmierer im allgemeinen als Gegner anstatt als Kameraden zu betrachten.

source: The fundamental act of friendship among programmers is the sharing of programs; marketing arrangements now typically used essentially forbid programmers to treat others as friends.
de: Der fundamentale Akt der Freundschaft zwischen Programmierern ist das Teilen von Programmen; derzeitige Vermarktungspraktiken verbieten Programmierern im wesentlichen, sich gegenseitig als Freunde zu behandeln.

source: The purchaser of software must choose between friendship and obeying the law.
de: Der Käufer von Software hat die Wahl zwischen Freundschaft und Gesetzestreue.

source: Naturally, many decide that friendship is more important. But those who believe in law often do not feel at ease with either choice.
de: Naturgemäß entscheiden viele, dass Freundschaft für sie wichtiger ist, aber diejenigen, welche an das Gesetz glauben, haben eine schwere Entscheidung.

source: They become cynical and think that programming is just a way of making money.
de: Sie werden zynisch und betrachten Programmierung nur noch als eine Möglichkeit, Geld zu verdienen.

source: By working on and using GNU rather than proprietary programs, we can be hospitable to everyone and obey the law.
de: Durch die Arbeit an und mit GNU anstelle von proprietären Programmen, können wir gleichzeitig zu jedem gastfreundlich sein und das Gesetz befolgen.

source: In addition, GNU serves as an example to inspire and a banner to rally others to join us in sharing.
de: Außerdem dient GNU als inspirierendes Beispiel und Transparent, andere zu versammeln, um sich uns beim Teilen anzuschließen.

source: This can give us a feeling of harmony which is impossible if we use software that is not free.
de: Dies vermittelt uns ein Gefühl der Harmonie, das bei Nutzung unfreier Software unmöglich wäre.

source: For about half the programmers I talk to, this is an important happiness that money cannot replace.
de: Für rund die Hälfte der Programmierer, mit denen ich sprach, ist dies ein entscheidendes Glücksgefühl, das durch Geld nicht ersetzt werden kann.

source: How You Can Contribute (Nowadays, for software tasks to work on, see the High Priority Projects list and the GNU Help Wanted list, the general task list for GNU software packages.
de: Wie Sie beitragen können (Um an aktuellen Softwareaufgaben mitzuarbeiten, siehe Projekte hoher Priorität und GNU-Projekte, die Hilfe suchen, der allgemeinen Aufgabenliste für GNU-Software.

source: For other ways to help, see the guide to helping the GNU operating system.)
de: Für weitere Möglichkeiten der Hilfe siehe Ein Leitfaden zur Unterstützung des Betriebssystems GNU.)

source: I am asking computer manufacturers for donations of machines and money.
de: Ich bitte Rechnerhersteller um Rechner- und Geldspenden.

source: I'm asking individuals for donations of programs and work.
de: Einzelpersonen bitte ich um Spenden in Form von Programmen und Mitwirkung.

source: One consequence you can expect if you donate machines is that GNU will run on them at an early date.
de: Wenn Sie uns einen Rechner zur Verfügung stellen, können Sie damit rechnen, dass GNU relativ früh darauf laufen wird.

source: The machines should be complete, ready to use systems, approved for use in a residential area, and not in need of sophisticated cooling or power.
de: Die Rechner sollten komplette, gebrauchsfertige Systeme sein, in einer Wohnung benutzt werden können und keine außergewöhnliche Kühlung oder Stromversorgung benötigen.

source: I have found very many programmers eager to contribute part-time work for GNU.
de: Ich habe sehr viele Programmierer gefunden, die bereitwillig in Teilzeit zu GNU beitragen.

source: For most projects, such part-time distributed work would be very hard to coordinate; the independently written parts would not work together.
de: Für die meisten Projekte dürfte eine solche teilzeitlich verteilte Arbeit schwierig zu koordinieren sein; die unabhängig geschriebenen Teile würden nicht zusammenarbeiten.

source: But for the particular task of replacing Unix, this problem is absent.
de: Aber für diese besondere Aufgabe, Unix zu ersetzen, ist dieses Problem nicht vorhanden.

source: A complete Unix system contains hundreds of utility programs, each of which is documented separately.
de: Ein komplettes Unix-System enthält hunderte von Dienstprogrammen, von denen jedes separat dokumentiert ist.

source: Most interface specifications are fixed by Unix compatibility.
de: Die meisten Schnittstellenspezifikationen werden durch Unix-Kompatibilität geregelt.

source: If each contributor can write a compatible replacement for a single Unix utility, and make it work properly in place of the original on a Unix system, then these utilities will work right when put together.
de: Wenn jeder Mitwirkende einen kompatiblen Ersatz für ein einzelnes Unix-Dienstprogramm schreiben kann und dafür sorgt, dass es anstelle des Originals auf einem Unix-System funktioniert, werden diese Dienstprogramme direkt zusammenarbeiten.

source: Even allowing for Murphy to create a few unexpected problems, assembling these components will be a feasible task. (The kernel will require closer communication and will be worked on by a small, tight group.)
de: Selbst wenn wir Murphy erlauben, ein paar unerwartete Probleme zu schaffen, sollte das Zusammensetzen dieser Komponenten eine durchführbare Aufgabe sein (der Systemkern erfordert eine genauere Kommunikation und wird von einer kleinen, festen Gruppe bearbeitet).

source: If I get donations of money, I may be able to hire a few people full or part time.
de: Sollte ich Geldspenden erhalten, werden mich diese in die Lage versetzen, ein paar Personen in Voll- oder Teilzeitarbeit einzustellen.

source: The salary won't be high by programmers' standards, but I'm looking for people for whom building community spirit is as important as making money.
de: Die Gehälter werden nicht dem Standard von Programmierern entsprechen, aber ich suche Personen, für die das Bilden von Gemeinschaftsgeist wichtiger ist als Geld zu verdienen.

source: I view this as a way of enabling dedicated people to devote their full energies to working on GNU by sparing them the need to make a living in another way.
de: Ich betrachte dies als einen Weg, engagierten Menschen zu ermöglichen, ihre gesamte Energie der Arbeit an GNU zu widmen, indem ich sie von der Notwendigkeit freimache, ihren Lebensunterhalt auf andere Weise zu verdienen.

source: Why All Computer Users Will Benefit Once GNU is written, everyone will be able to obtain good system software free, just like air.(3)
de: Warum alle Rechnerbenutzer profitieren Sobald GNU geschrieben ist, wird jedermann in der Lage sein, gute Systemsoftware frei zu erhalten, so wie Luft.(3)

source: This means much more than just saving everyone the price of a Unix license.
de: Dies bedeutet mehr, als nur jedem den Preis für eine Unix-Lizenz einzusparen.

source: It means that much wasteful duplication of system programming effort will be avoided.
de: Es bedeutet, dass viel unnötige Doppelarbeit an System-Programmieraufwand vermieden werden kann.

source: This effort can go instead into advancing the state of the art.
de: Diese Anstrengungen können stattdessen eingesetzt werden, um den Stand der Technik voranzubringen.

source: Complete system sources will be available to everyone.
de: Der komplette Quelltext des Systems wird für jedermann verfügbar sein.

source: As a result, a user who needs changes in the system will always be free to make them himself, or hire any available programmer or company to make them for him.
de: Als Ergebnis wird jeder Benutzer, der Änderungen im System machen muss die Freiheit haben, diese selbst vorzunehmen, oder einen Programmierer oder eine Firma damit beauftragt.

source: Users will no longer be at the mercy of one programmer or company which owns the sources and is in sole position to make changes.
de: Die Benutzer werden nicht länger von der Gnade einzelner Programmierer oder Unternehmen abhängig sein, welche den Quelltext besitzen und daher als einzige Änderungen vornehmen können.

source: Schools will be able to provide a much more educational environment by encouraging all students to study and improve the system code.
de: Schulen können ein viel besseres pädagogisches Umfeld bieten, wenn sie die Schüler dazu anhalten, den Code des Betriebssystems zu untersuchen und zu verbessern.

source: Harvard's computer lab used to have the policy that no program could be installed on the system if its sources were not on public display, and upheld it by actually refusing to install certain programs.
de: Harvards Rechnerraum verlangte eine Richtlinie, dass kein Programm im System installiert werden durfte, dessen Quelltext nicht öffentlich zugänglich war ‑ und hielten dies aufrecht, indem bestimmte Programme tatsächlich nicht installiert wurden.

source: I was very much inspired by this.
de: Ich war sehr begeistert.

source: Finally, the overhead of considering who owns the system software and what one is or is not entitled to do with it will be lifted.
de: Und schließlich wird auch der Verwaltungsaufwand vermieden, zu überlegen, wem die Systemsoftware gehört und was man damit tun darf und was nicht.

source: Arrangements to make people pay for using a program, including licensing of copies, always incur a tremendous cost to society through the cumbersome mechanisms necessary to figure out how much (that is, which programs) a person must pay for.
de: Durch Vorkehrungen, um Menschen für die Nutzung eines Programms, einschließlich der Lizenzierung von Kopien, zahlen zu lassen, entstehen immer gewaltige Kosten für die Gesellschaft durch den schwerfälligen Mechanismus notwendig, um herauszufinden für wie viel (d. h. für welche Programme) eine Person zahlen muss.

source: And only a police state can force everyone to obey them.
de: Und nur ein Polizeistaat kann jeden dazu zwingen, sie zu befolgen.

source: Consider a space station where air must be manufactured at great cost: charging each breather per liter of air may be fair, but wearing the metered gas mask all day and all night is intolerable even if everyone can afford to pay the air bill.
de: Stellen Sie sich eine Raumstation vor, wo die Luft mit großem Aufwand hergestellt werden muss: Es mag fair sein, Atemluft pro verbrauchten Liter zu berechnen, aber die gebührenpflichtige Gasmaske, den ganzen Tag und die ganze Nacht tragend, ist unerträglich, selbst wenn für jeden die Berechnung der Luft erschwinglich ist.

source: And the TV cameras everywhere to see if you ever take the mask off are outrageous.
de: Und allgegenwärtige Fernsehkameras, die überwachen, ob jemand die Maske abnimmt, sind ungeheuerlich.

source: It's better to support the air plant with a head tax and chuck the masks.
de: Es ist besser, die Luftanlage mit einer Pro-Kopf-Steuer zu finanzieren und die Masken wegzuwerfen.

source: Copying all or parts of a program is as natural to a programmer as breathing, and as productive.
de: Das Kopieren eines Programms oder Teile davon ist für einen Programmierer ebenso selbstverständlich wie das Atmen, und genauso nutzbringend.

source: It ought to be as free.
de: Es sollte genauso frei sein.

source: Some Easily Rebutted Objections to GNU's Goals “Nobody will use it if it is free, because that means they can't rely on any support.”
de: Einige leicht zu entkräftende Einwände gegen die Ziele von GNU Niemand wird es benutzen, wenn es umsonst ist, weil das bedeutet, sich nicht auf Unterstützung verlassen zu können.

source: “You have to charge for the program to pay for providing the support.”
de: Man muss etwas für das Programm berechnen, um Unterstützung anbieten zu können.

source: If people would rather pay for GNU plus service than get GNU free without service, a company to provide just service to people who have obtained GNU free ought to be profitable.(4)
de: Wenn man für GNU mit Dienstleistung eher bezahlen würde als GNU ohne Dienstleistung umsonst zu erhalten, sollte ein Unternehmen, dass diese Dienstleistung speziell für Personen anbietet, die GNU umsonst erhalten haben, profitabel sein.(4)

source: We must distinguish between support in the form of real programming work and mere handholding.
de: Wir müssen zwischen Unterstützung in Form von echter Programmierarbeit und Händchenhalten unterscheiden.

source: The former is something one cannot rely on from a software vendor.
de: Ersteres ist etwas, das man nicht von einem Softwarehändler erwarten kann.

source: If your problem is not shared by enough people, the vendor will tell you to get lost.
de: Wenn Ihr Problem nicht von genügend Personen geteilt wird, wird der Händler Ihnen sagen, Sie hätten sich verlaufen.

source: If your business needs to be able to rely on support, the only way is to have all the necessary sources and tools.
de: Wenn Ihr Unternehmen darauf angewiesen ist, sich auf Unterstützung zu verlassen, ist der einzige Weg, alle notwendigen Quelltexte und Werkzeuge vorliegen zu haben.

source: Then you can hire any available person to fix your problem; you are not at the mercy of any individual.
de: Dann können Sie jede verfügbare Person beauftragen, Ihr Problem zu lösen; Sie sind nicht Einzelnen ausgeliefert.

source: With Unix, the price of sources puts this out of consideration for most businesses.
de: Mit Unix ist dies infolge des hohen Preises der Quelltexte für die meisten Unternehmen unerschwinglich.

source: With GNU this will be easy.
de: Mit GNU wird dies leicht sein.

source: It is still possible for there to be no available competent person, but this problem cannot be blamed on distribution arrangements.
de: Es ist zwar immer noch möglich, dass keine kompetente Person zur Verfügung steht, aber dies Problem liegt dann nicht an den Vertriebsbedingungen.

source: GNU does not eliminate all the world's problems, only some of them.
de: GNU beseitigt nicht alle Probleme der Welt, sondern nur bestimmte.

source: Meanwhile, the users who know nothing about computers need handholding: doing things for them which they could easily do themselves but don't know how.
de: Gleichzeitig sind Anwender ohne Rechnerwissen auf Hilfe angewiesen: Dinge erledigen, die sie leicht selbst tun könnten, aber nicht wissen, wie.

source: Such services could be provided by companies that sell just handholding and repair service.
de: Solche Dienstleistungen können von Unternehmen angeboten werden, die gerade solche Benutzerhilfen und Reparaturdienste anbieten.

source: If it is true that users would rather spend money and get a product with service, they will also be willing to buy the service having got the product free.
de: Wenn es stimmt, dass Benutzer es vorziehen für ein Produkt mit Dienstleistung zu bezahlen, werden sie auch bereit sein die Dienstleistung zu bezahlen, wenn sie das Produkt umsonst erhalten haben.

source: The service companies will compete in quality and price; users will not be tied to any particular one.
de: Die Dienstleistungsunternehmen werden in Qualität und Preis miteinander konkurrieren; Benutzer nicht an ein bestimmtes gebunden sein.

source: Meanwhile, those of us who don't need the service should be able to use the program without paying for the service.
de: In der Zwischenzeit sollten diejenigen von uns, die die Dienstleistung nicht benötigen, in der Lage sein, das Programm zu benutzen, ohne die Dienstleistung bezahlen zu müssen.

source: “You cannot reach many people without advertising, and you must charge for the program to support that.”
de: Ohne Werbung kann man nicht viele Menschen erreichen, und man muss etwas für das Programm berechnen, um dies zu ermöglichen.

source: “It's no use advertising a program people can get free.”
de: Es bringt nichts Werbung für ein Programm zu machen, was man umsonst bekommen kann.
